["overall", "service", "check", "staff", "waiters", "rude", "embarrassing", "rooms", "small", "similar", "design", "comfort", "hotels", "five", "stars", "excellent", "price", "value", "ratio", "providing", "time", "management", "amazing", "really", "friendly", "standard", "quite", "basic", "cheaply", "decorated", "linen", "beds", "something", "might", "expect", "find", "cheap", "hotel", "sofa", "bed", "daughter", "slept", "uncomfortable", "unacceptable", "music", "playing", "pool", "bored", "nice", "view", "communal", "parts", "room", "bit", "run", "broken", "ac", "worn", "furniture", "bathroom", "noisy", "onsite", "restaurant", "provided", "good", "mix", "food", "breakfast", "buffett", "served", "inside", "outside", "lovely", "enjoy", "eating", "freezing", "heated", "never", "got", "paddling", "feet", "first", "night", "move", "nightclubs", "surround", "awful", "prices", "menu", "expensive", "miserable", "rudest", "people", "ever", "pleasure", "meeting", "english", "playstation", "cafe", "wanted", "lot", "money", "hour", "play", "pay", "child", "roka", "salad", "fresh", "salmon", "cooked", "came", "back", "apology", "whatsoever", "reception", "severely", "lack", "skills", "vague", "answers", "queries", "slow", "front", "office", "dont", "recommend", "cold", "canteen", "drinks", "ok", "mouthwatering", "buffet", "desk", "beyond", "generous", "size", "comfortable", "others", "serious", "ear", "infection", "bill", "nearly", "hospital", "medication", "weeks", "get", "normal", "outdated", "spacious", "paid", "much", "even", "though", "didnt", "extra", "stingy", "generally", "especially", "french", "fries", "last", "evening", "pasta", "obviously", "taken", "fridge", "forgotten", "heat", "customer", "relations", "chief", "kind", "professional", "strongly", "advice", "stay", "bodrum", "adorable", "clean", "always", "helpful", "great", "smile", "faces", "located", "arround", "recently", "stayed", "wonderful", "delicious", "arriving", "limited", "opinion", "unfriendly", "indeed", "beverages", "reasonably", "priced", "general", "pricing", "reasonable", "garden", "setting", "overlooking", "set", "party", "best", "advise", "rent", "two", "absolutely", "would", "help", "variety", "quality", "bad", "worst", "ive", "seen", "included", "concept", "found", "hair", "three", "times", "jacuzzi", "indoor", "omelettes", "request", "pictures", "actually", "order", "well", "appointed", "double", "lots", "space", "everything", "working", "condition", "pricewise", "cuisine", "tables", "dirty", "floor", "plates", "cleared", "away", "one", "point", "courses", "sat", "table", "dinner", "old", "chose", "affordable", "surprised", "saw", "understood", "payed", "delux", "made", "trip", "delivered", "decor", "extremely", "dated", "stunk", "cigarettes", "supposed", "nonsmoking", "sheets", "dirtysandy", "rough", "wifi", "hardly", "worked", "barely", "cooled", "cant", "thankful", "enough", "every", "member", "making", "memorable", "reunion", "charged", "cost", "area", "centre", "built", "around", "private", "quiet", "busy", "towels", "sun", "minibar", "cl", "water", "pounds", "grounds", "kept", "spotlessly", "comfy", "variaty", "wide", "suggest", "try", "lean", "leaves", "folded", "halloumi", "cheeses", "grilled", "chicked", "risotto", "also", "fine", "smiling", "helping", "manner", "seems", "refurbished", "nicely", "unprofessional", "impolite", "cases", "crude", "poor", "internet", "called", "ask", "fix", "reply", "techinician", "still", "days", "unexpectedly", "shocking", "treatment", "certain", "members", "real", "shame", "let", "unlikeable", "nothing", "children", "except", "big", "main", "feel", "disturbed", "fact", "guests", "beach", "equally", "fantastic", "disgrace", "shouldnt", "high", "maintenance", "polite", "attentive", "tasteless", "prepared", "choice", "local", "presented", "favorite", "part", "far", "single", "committed", "creating", "vacation", "juices", "sweetened", "colored", "terrible", "issues", "getting", "sized", "blue", "flag", "silent", "highest", "hospitality", "level", "warmness", "restaurants", "seemed", "like", "want", "checking", "say", "least", "gave", "key", "bigger", "purse", "card", "system", "breath", "take", "knew", "definitely", "wouldnt", "come", "regret", "ensure", "awake", "air", "conditioned", "cleaned", "day", "deluxe", "think", "upgraded", "could", "wrong", "better", "anticipated", "huge", "im", "ft", "powerful", "shower", "deep", "bath", "faultless", "bar", "close", "beachdecking", "la", "carte", "speak", "terms", "services", "lower", "end", "look", "photos", "beautiful", "vast", "amount", "pick", "lounge", "cocktail", "hand", "eveything", "court", "loved", "luxe", "padded", "supplied", "enjoyed", "watching", "sunset", "stinky", "often", "lazy", "usually", "standing", "incredible", "turkish", "tradition", "thai", "american", "classics", "foods", "per", "worth", "serve", "carried", "behind", "screens", "queue", "waiting", "whilst", "going", "mind", "hot", "begin", "withwe", "observed", "aimlessly", "talking", "phones", "massive", "love", "low", "fruit", "various", "breads", "home", "honey", "range", "continental", "options", "perfect", "trying", "new", "offer", "useless", "sea", "experience", "holes", "door", "handle", "falling", "super", "chance", "must", "exceeds", "expectations", "okay", "booked", "family", "twin", "queen", "toilet", "flush", "doesnt", "work", "safe", "manager", "id", "available", "change", "unfortunately", "tired", "smelly", "sorry", "hear", "property", "meet", "regarding", "cleanless", "personel", "either", "compared", "trained", "arrived", "curtain", "tiles", "cracks", "filthy", "needed", "full", "mould", "isnt", "luke", "warm", "disgusting", "vile", "joke", "conditioner", "beaches", "cramped", "horrible", "specially", "tasty", "thing", "admit", "eat", "personnel", "chef", "coke", "ten", "turkey", "tasted", "smelled", "sufficient", "spending", "swimming", "irresponsible", "accommodation", "many", "communicating", "idea", "saying", "things", "felt", "prison", "expected", "frankly", "disappointing", "colder", "charge", "euros", "use", "daily", "superb", "views", "across", "town", "castle", "loud", "world", "deal", "budget", "upcoming", "years", "return", "opportunity", "sand", "tissues", "sponge", "shampoo", "refill", "empty", "pretend", "upscale", "surprisingly", "free", "breakfasts", "put", "greatanything", "need", "satisfied", "bay", "pretty", "edible", "recycled", "badly", "stores", "gets", "crowded", "due", "covid", "consisted", "sloppy", "scrambled", "eggs", "rock", "hard", "scones", "salads", "minutes", "bread", "rule", "craving", "toast", "lunch", "meals", "salty", "samey", "poorly", "maintained", "staffs", "specialty", "bahar", "poolside", "asked", "trap", "site", "closed", "week", "added", "contact", "including", "receptionists", "welcome", "language", "modern", "whatever", "bathrobes", "flipflops", "dental", "kits", "iron", "spent", "sunbeds", "exclusive", "relaxed", "tennis", "overlooked", "poolgardens", "boring", "ate", "couple", "nights", "club", "overcrowded", "visit", "struggled", "lounger", "visited", "spare", "umbrellas", "however", "noticieably", "improve", "eid", "celebrations", "finished", "unimpressive", "horrendous", "showed", "picture", "advertising", "beware", "tiny", "balcony", "fits", "chair", "chefs", "juice", "alcohol", "noise", "till", "street", "arrogant", "save", "lives", "matter", "please", "thank", "unique", "smell", "performance", "shops", "considered", "feeding", "thought", "dismissive", "inattentive", "mixture", "decent", "building", "disrepair", "scam", "bland", "dishes", "brought", "eaten", "became", "favourite", "place", "workingi", "offered", "another", "wasnt", "credit", "ways", "remember", "ready", "serviced", "mini", "stocked", "outdoor", "plenty", "seating", "areas", "relax", "drink", "simple", "wait", "square", "metres", "possibly", "smallest", "fashioned", "hotelthe", "richer", "whole", "spotless", "dreadful", "disappointment", "round", "oh", "god", "experienced", "acknowledged", "treats", "royalty", "constantly", "cleaning", "calm", "surve", "although", "average", "datewhen", "wine", "bottle", "opener", "glasses", "bother", "replaced", "arrival", "rarely", "treat", "large", "almost", "tummy", "rashes", "hygiene", "vegetarian", "staying", "apparently", "suffocating", "asking", "centrally", "luxurious", "tv", "discreet", "conditioning", "ignorant", "sell", "massages", "refuse", "theyre", "youeven", "clients", "asleep", "man", "waits", "mins", "looking", "repetitive", "stale", "passed", "lamb", "kebab", "boiled", "frankfurters", "rubbery", "cheese", "cheddar", "flavourless", "horribly", "sweet", "cakes", "soaked", "olive", "oil", "waterlogged", "steamed", "rice", "chips", "fried", "retried", "mealtimes", "omelette", "catered", "babies", "raw", "equipped", "little", "tight", "slimy", "green", "looked", "hadnt", "year", "exceptional", "ripped", "shop", "side", "resort", "concentration", "camp", "hilton", "perfectly", "within", "location", "raised", "sandy", "bedsand", "probably", "used", "city", "towards", "shown", "next", "row", "imagen", "alone", "tries", "fulfill", "wishes", "organized", "right", "job", "pleased", "disappointed", "argued", "receptionist", "anywhere", "attention", "detail", "friendliness", "team", "dream", "monitoring", "safety", "tried", "different", "unhappy", "uniformly", "interaction", "disaster", "bearable", "dry", "processed", "rolls", "produce", "strange", "fruits", "herbs", "vegetables", "benefit", "concentrating", "rather", "western", "eatable", "occasions", "everyone", "anytime", "bars", "future", "pleasantly", "bathrooms", "showers", "additional", "fee", "nuisance", "concerned", "fees", "plans", "theres", "paying", "charges", "bothered", "intend", "complete", "waste"]